; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v3)
             (pred_2 ?v5 ?v10)
             (pred_7 ?v6 ?v10)
             (pred_10 ?v7 ?v6 )
	     (pred_8 ?v6)
             (pred_5 ?v1)
             (pred_3 ?v5)
             (pred_9 ?v10)
             (pred_1 ?v6)
             (pred_6 ?v5)
             (pred_4 ?v6)
             (pred_12 ))



(:action op_4
:parameters (?v12 ?v11 ?v9 ?v8)
:precondition (and (pred_5 ?v12) (pred_5 ?v11) (pred_3 ?v9) (pred_9 ?v8)
          (pred_11 ?v12 ?v11) (pred_2 ?v9 ?v8)
                   (pred_7 ?v11 ?v8) (pred_8 ?v12) 
                   (pred_1 ?v11) (pred_6 ?v9))
:effect (and  (pred_4 ?v11) (not (pred_1 ?v11))))


(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_5 ?v2)
               (pred_8 ?v12) (pred_11 ?v12 ?v2) (pred_4 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v12))))

(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_5 ?v12) (pred_3 ?v9) 
                  (pred_8 ?v12) (pred_10 ?v9 ?v12) (pred_12 ))
:effect (and (pred_6 ?v9)
   (not (pred_10 ?v9 ?v12)) (not (pred_12 ))))


(:action op_5
:parameters (?v12 ?v4 ?v13)
:precondition (and (pred_5 ?v12) (pred_3 ?v4) (pred_3 ?v13)
                  (pred_8 ?v12) (pred_6 ?v13) (pred_10 ?v4 ?v12))
:effect (and (pred_6 ?v4) (pred_10 ?v13 ?v12)
        (not (pred_6 ?v13)) (not (pred_10 ?v4 ?v12))))

(:action op_1
:parameters (?v12 ?v9)
:precondition (and (pred_5 ?v12) (pred_3 ?v9) 
                  (pred_8 ?v12) (pred_6 ?v9))
:effect (and (pred_12 ) (pred_10 ?v9 ?v12) (not (pred_6 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_19 obj_30 obj_20 obj_05 obj_27 obj_10 obj_26 obj_08 obj_06 obj_28 obj_24 obj_09 obj_14 obj_03 obj_21 obj_11 obj_12 obj_01 obj_17 obj_02 obj_29 obj_04 obj_18 obj_07
    obj_23 obj_25 obj_16
    obj_13 obj_31 obj_22
    )

    (:init
       (pred_12)

       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_30)
       (pred_5 obj_20)
       (pred_5 obj_05)
       (pred_5 obj_27)
       (pred_5 obj_10)
       (pred_5 obj_26)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_28)
       (pred_5 obj_24)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_5 obj_03)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_02)
       (pred_5 obj_29)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_07)
       (pred_9 obj_23)
       (pred_9 obj_25)
       (pred_9 obj_16)
       (pred_3 obj_13)
       (pred_3 obj_31)
       (pred_3 obj_22)

       (pred_11 obj_15 obj_27)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_19 obj_30)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_30 obj_26)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_30 obj_19)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_30)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_27 obj_28)
       (pred_11 obj_27 obj_10)
       (pred_11 obj_27 obj_15)
       (pred_11 obj_10 obj_24)
       (pred_11 obj_10 obj_26)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_27)
       (pred_11 obj_26 obj_09)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_26 obj_30)
       (pred_11 obj_26 obj_10)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_28 obj_24)
       (pred_11 obj_28 obj_27)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_24 obj_09)
       (pred_11 obj_24 obj_10)
       (pred_11 obj_24 obj_28)
       (pred_11 obj_09 obj_12)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_26)
       (pred_11 obj_09 obj_24)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_21 obj_02)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_11 obj_29)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_21)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_09)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_02 obj_29)
       (pred_11 obj_02 obj_21)
       (pred_11 obj_29 obj_04)
       (pred_11 obj_29 obj_11)
       (pred_11 obj_29 obj_02)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_29)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_18)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_21)
       (pred_7  obj_11 obj_23)
       (pred_7  obj_02 obj_25)
       (pred_7  obj_21 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_30)
       (pred_4 obj_20)
       (pred_4 obj_05)
       (pred_4 obj_27)
       (pred_4 obj_10)
       (pred_4 obj_26)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_28)
       (pred_4 obj_24)
       (pred_4 obj_09)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_4 obj_17)
       (pred_4 obj_29)
       (pred_4 obj_04)
       (pred_4 obj_18)
       (pred_4 obj_07)

       (pred_2  obj_13 obj_23)
       (pred_2  obj_31 obj_25)
       (pred_2  obj_22 obj_16)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_31 obj_14)
       (pred_10 obj_22 obj_05)
       (pred_8 obj_30)
    )

    (:goal (and
       (pred_10 obj_31 obj_18)
    ))
(:constraints
  (always (not (pred_8 obj_01)))
)
)

; plan
1. (op_2 obj_30 obj_20)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_20)
   goals met: 0 of 1
2. (op_2 obj_20 obj_08)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_08)
   goals met: 0 of 1
3. (op_2 obj_08 obj_14)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_14)
   goals met: 0 of 1
4. (op_3 obj_14 obj_31)
   deleted: (pred_10 obj_31 obj_14) (pred_12)
   added: (pred_6 obj_31)
   goals met: 0 of 1
5. (op_2 obj_14 obj_09)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_09)
   goals met: 0 of 1
6. (op_2 obj_09 obj_12)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_12)
   goals met: 0 of 1
7. (op_2 obj_12 obj_04)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_04)
   goals met: 0 of 1
8. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 0 of 1
9. (op_1 obj_18 obj_31)
   deleted: (pred_6 obj_31)
   added: (pred_12) (pred_10 obj_31 obj_18)
   goals met: 1 of 1
